Revit 2027 API
MEPNetworkIterator(Document, MEPAnalyticalNode, MEPAnalyticalSegment) Constructor
 Creates an iterator to visit the connected segments on one side of the network.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MEPNetworkIterator(
	Document pADoc,
	MEPAnalyticalNode startNode,
	MEPAnalyticalSegment startSegment
)
Public Sub New (
	pADoc As Document,
	startNode As MEPAnalyticalNode,
	startSegment As MEPAnalyticalSegment
)
public:
MEPNetworkIterator(
	Document^ pADoc,
	MEPAnalyticalNode^ startNode,
	MEPAnalyticalSegment^ startSegment
)
new :
        pADoc : Document *
        startNode : MEPAnalyticalNode *
        startSegment : MEPAnalyticalSegment -> MEPNetworkIterator
Parameters
pADoc Document
 The document of the analytical network.
startNode MEPAnalyticalNode
 The starting analytical node. It must be one of two nodes of the starting segment.
startSegment MEPAnalyticalSegment
 The starting analytical segment to specify the traversing direction from the starting node.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
MEPNetworkIterator Class
MEPNetworkIterator Overload
Autodesk.Revit.DB.Analysis Namespace